model/sogcm/experiment/exp_WindDrivenCirculation/Exp_WindDrivenCirculation_homoFluid_consider.org
#+TITLE: 水惑星設定における軸対称風成循環の数値実験:考察

#+AUTOHR: 河合 佑太
#+LANGUAGE: ja
#+OPTIONS: H:2
#+HTML_MATHJAX: align:"left" mathml:t path:"http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"></SCRIPT>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./../org.css" />

#+LaTeX_HEADER: \usepackage{natbib}

* 水平解像度依存性

- 赤道以外の循環
  - 本数値実験における水平解像度以下(< Pl170)でも十分に表現できる. 

- 赤道近傍の循環
  - 赤道外の循環に比べ, 空間スケールがとても小さい. 
  - 本実験で用いた水平渦粘性では, Pl341 以上の水平解像度を用いないと, 精度良く表現することができない. 
  - 水平解像度が不足する場合には循環を解像できず, ギブス振動によって全球に渡り数値解が乱される. 

- 三次元計算・長時間積分への示唆
  - 赤道近傍の循環に起因する高い水平解像度を用いることは計算負荷が高く厳しい. 
  - 水平渦粘性や超粘性の大きさを調節し, 赤道近傍の循環の幅を大きくすることで, 低解像度でも解像可能にする必要があり. 
    - 恣意的な水平粘性の増加によって, 大規模な循環場がどの程度変化してしまうかは, 注意が必要(例: Ah1e5 の計算結果). 

* 鉛直解像度依存性

- 上下端のエクマン層が解像できる鉛直解像度が必要(本実験で用いた鉛直渦粘性では, 60 層以上). 
- 鉛直解像度が不足する場合には, 循環の振幅を過小評価し, またギブス振動が発生する. 
  - ギブス振動の影響は, 内部領域の南北流そして鉛直流に現れ, 本来の鉛直分布が乱される. 

- 三次元計算・長時間積分への示唆
  - 必要とする全鉛直格子数を減らすために, 鉛直座標を上下端で収縮するような座標系に座標変換する. 
    - もとの chebyshev 格子よりも, エクマン層内の格子点数は増加する. 

* 水平渦粘性依存性

- 赤道近傍の循環: 水平渦粘性に鋭敏である. 
  - 水平幅: スケール解析によれば, (水平エクマン数)^{1/3}
  - 強度: 水平渦粘性が小さいほど, 赤道近傍に局所化し循環は強くなる. 

- 赤道遠方の循環: 水平渦粘性の役割は小さい
  - 渦度バランスは, 上下端のエクマン層からのエクマンパンピングで決まる. その中で, 水平渦粘性の役割は小さい(Ah1e3, Ah1e4 の場合)
    - 子午面循環の南北流は内部領域では存在しない
  - 水平粘性渦粘性の役割が, エクマンパンピングと同程度重要になると, 内部領域の東西流や子午面循環の構造が変化する(Ah1e5 の場合)
    - 水平粘性による東西流の振幅の減少が顕著になる. 
    - 子午面循環の南北流が, 内部領域でも存在するようになる

* 数値解と解析的な近似解との比較

- Ah1e3, Ah1e4 では, 数値解と解析的な近似解はよく一致する. 
  - 非粘性の極限において, 解析的な近似解は無次元単位で O(Ro) までの精度をもつ.  
    - 実際, 水平渦粘性を減少させていくと, そのことが確認できる. 

- 一方, Ah1e5 では, 数値解と解析的な近似解は大きくずれる.  
  - 近似解の水平渦粘性に伴う修正は, Ro の最低次をさらに $r_{H,V}$ で展開することで求めるため, 
    $r_{H,V}$ が十分に小さくない場合には近似解は破綻する. 
  - 物理的には, Ah1e5 では, 渦度バランスにおいて, 水平渦粘性の寄与が, エクマン・パンピングによる寄与と同程度になることを意味する. 
