model/sogcm/experiment/exp_WindDrivenCirculation/Exp_WindDrivenCirculation_homoFluid_consider.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>水惑星設定における軸対称風成循環の数値実験:考察</title>
<!-- 2014-07-23 水 20:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kawai Yuta" />
<link rel="stylesheet" type="text/css" href="./../org.css" />
</head>
<body>
<div id="content">
<h1 class="title">水惑星設定における軸対称風成循環の数値実験:考察</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 水平解像度依存性</a></li>
<li><a href="#sec-2">2. 鉛直解像度依存性</a></li>
<li><a href="#sec-3">3. 水平渦粘性依存性</a></li>
<li><a href="#sec-4">4. 数値解と解析的な近似解との比較</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 水平解像度依存性</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>赤道以外の循環
<ul class="org-ul">
<li>本数値実験における水平解像度以下(&lt; Pl170)でも十分に表現できる. 
</li>
</ul>
</li>

<li>赤道近傍の循環
<ul class="org-ul">
<li>赤道外の循環に比べ, 空間スケールがとても小さい. 
</li>
<li>本実験で用いた水平渦粘性では, Pl341 以上の水平解像度を用いないと, 精度良く表現することができない. 
</li>
<li>水平解像度が不足する場合には循環を解像できず, ギブス振動によって全球に渡り数値解が乱される. 
</li>
</ul>
</li>

<li>三次元計算・長時間積分への示唆
<ul class="org-ul">
<li>赤道近傍の循環に起因する高い水平解像度を用いることは計算負荷が高く厳しい. 
</li>
<li>水平渦粘性や超粘性の大きさを調節し, 赤道近傍の循環の幅を大きくすることで, 低解像度でも解像可能にする必要があり. 
<ul class="org-ul">
<li>恣意的な水平粘性の増加によって, 大規模な循環場がどの程度変化してしまうかは, 注意が必要(例: Ah1e5 の計算結果). 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 鉛直解像度依存性</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>上下端のエクマン層が解像できる鉛直解像度が必要(本実験で用いた鉛直渦粘性では, 60 層以上). 
</li>
<li>鉛直解像度が不足する場合には, 循環の振幅を過小評価し, またギブス振動が発生する. 
<ul class="org-ul">
<li>ギブス振動の影響は, 内部領域の南北流そして鉛直流に現れ, 本来の鉛直分布が乱される. 
</li>
</ul>
</li>

<li>三次元計算・長時間積分への示唆
<ul class="org-ul">
<li>必要とする全鉛直格子数を減らすために, 鉛直座標を上下端で収縮するような座標系に座標変換する. 
<ul class="org-ul">
<li>もとの chebyshev 格子よりも, エクマン層内の格子点数は増加する. 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 水平渦粘性依存性</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>赤道近傍の循環: 水平渦粘性に鋭敏である. 
<ul class="org-ul">
<li>水平幅: スケール解析によれば, (水平エクマン数)<sup>1/3</sup>
</li>
<li>強度: 水平渦粘性が小さいほど, 赤道近傍に局所化し循環は強くなる. 
</li>
</ul>
</li>

<li>赤道遠方の循環: 水平渦粘性の役割は小さい
<ul class="org-ul">
<li>渦度バランスは, 上下端のエクマン層からのエクマンパンピングで決まる. その中で, 水平渦粘性の役割は小さい(Ah1e3, Ah1e4 の場合)
<ul class="org-ul">
<li>子午面循環の南北流は内部領域では存在しない
</li>
</ul>
</li>
<li>水平粘性渦粘性の役割が, エクマンパンピングと同程度重要になると, 内部領域の東西流や子午面循環の構造が変化する(Ah1e5 の場合)
<ul class="org-ul">
<li>水平粘性による東西流の振幅の減少が顕著になる. 
</li>
<li>子午面循環の南北流が, 内部領域でも存在するようになる
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 数値解と解析的な近似解との比較</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Ah1e3, Ah1e4 では, 数値解と解析的な近似解はよく一致する. 
<ul class="org-ul">
<li>非粘性の極限において, 解析的な近似解は無次元単位で O(Ro) までの精度をもつ.  
<ul class="org-ul">
<li>実際, 水平渦粘性を減少させていくと, そのことが確認できる. 
</li>
</ul>
</li>
</ul>
</li>

<li>一方, Ah1e5 では, 数値解と解析的な近似解は大きくずれる.  
<ul class="org-ul">
<li>近似解の水平渦粘性に伴う修正は, Ro の最低次をさらに \(r_{H,V}\) で展開することで求めるため, 
    \(r_{H,V}\) が十分に小さくない場合には近似解は破綻する. 
</li>
<li>物理的には, Ah1e5 では, 渦度バランスにおいて, 水平渦粘性の寄与が, エクマン・パンピングによる寄与と同程度になることを意味する. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Kawai Yuta</p>
<p class="date">Created: 2014-07-23 水 20:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
